clc;
clear all;


% 
% 1）添加当前文件夹的路径
% addpath(pwd)
% 2）删除当前文件夹的路径
% rmpath(pwd)
% 3）添加当前文件夹以及所有子文件夹的路径
% addpath(genpath(pwd))
% 4）移除当前文件夹以及所有子文件夹的路径
% rmpath(genpath(pwd))

folder ='QCAT/qcat';  % vview所在文件夹
addpath( genpath(folder) ); 
%===============================================================
B_inv=[1 -1 1;1 1 1;0 1 1;-1 1 1;-1 -1 1;0 -1 1];%实际用的，delta=B_inv*u
% B=pinv(B_inv);
B=[0.25 0.25 0 -0.25 -0.25 0;-0.125 0.125 0.25 0.125 -0.125 -0.25;1/6 1/6 1/6 1/6 1/6 1/6];% 机理建模得到
%===============================================================

plim=[-ones(6,1)*30*pi/180 ones(6,1)*30*pi/180];

% q=vview(B,plim,pinv(B))
q=vview(B,plim,B_inv)
